In [106]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name' : ['AA', 'BB', 'CC', 'DD'],
    'age' : [10, 22, 33, 44],
    'gender' : ['F', 'M', 'M', 'F']
}, columns=['name', 'age', 'gender', 'position'],
   index=[1,2,3,4])
df

  name  age gender position
1   AA   10      F      NaN
2   BB   22      M      NaN
3   CC   33      M      NaN
4   DD   44      F      NaN

In [128]:
df.values

array([['AA', 10, 'F', nan],
       ['BB', 22, 'M', 1.0],
       ['CC', 33, 'M', nan],
       ['DD', 44, 'F', 5.9]], dtype=object)

In [107]:
# df.position = 'L1'
df.position = np.arange(4.)
df

  name  age gender  position
1   AA   10      F       0.0
2   BB   22      M       1.0
3   CC   33      M       2.0
4   DD   44      F       3.0

In [108]:
df.columns

Index([u'name', u'age', u'gender', u'position'], dtype='object')

In [109]:
df.gender[df.age > 20][df.gender == 'M'][df.position ==1.0]

2    M
Name: gender, dtype: object

In [110]:
df[['name','age']]

  name  age
1   AA   10
2   BB   22
3   CC   33
4   DD   44

In [111]:
df.ix[2]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name        BB
age         22
gender       M
position     1
Name: 2, dtype: object

In [112]:
ser1 = pd.Series([1.0,5.9,], index=[2,4])
df.position = ser1
df

  name  age gender  position
1   AA   10      F       NaN
2   BB   22      M       1.0
3   CC   33      M       NaN
4   DD   44      F       5.9

In [113]:
df['NewCol'] = df.position == 1.0
df

  name  age gender  position  NewCol
1   AA   10      F       NaN   False
2   BB   22      M       1.0    True
3   CC   33      M       NaN   False
4   DD   44      F       5.9   False

In [114]:
del df['NewCol']

In [115]:
df2 = pd.DataFrame({
    'name' : {'fname' : 'sakshi', 'lname' : 'goyal'},
    'address' : {'line1' : 3, 'line2' : 4}
})
df2.T

          fname line1 line2  lname
address     NaN     3     4    NaN
name     sakshi   NaN   NaN  goyal

In [150]:
df3 = pd.DataFrame({
    'name' : df.name[0:3],
    'age' : df.age[:]
})
df3

      age name
name
1      10   AA
2      22   BB
3      33   CC
4      44  NaN

In [126]:
# set index and column name of dict inside dict type data frame
df2.index.name = 'name'
df2.columns.name = '<--->'
df2

<--->  address    name
name
fname      NaN  sakshi
line1      3.0     NaN
line2      4.0     NaN
lname      NaN   goyal

In [129]:
df2.values

array([[nan, 'sakshi'],
       [3.0, nan],
       [4.0, nan],
       [nan, 'goyal']], dtype=object)

In [154]:
# reindexing
df3.index.name = 'index'
df4 = df3.reindex([2, 4, 3, 8], fill_value = 0, method='ffill')
df4

       age name
index
2       22   BB
4       44  NaN
3       33   CC
8       44  NaN

In [232]:
df5 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'c', 'd', 'e'], columns = ['first', 'second','third','forth'])
df5.index.name = 'ind'
df5

     first  second  third  forth
ind
a        0       1      2      3
c        4       5      6      7
d        8       9     10     11
e       12      13     14     15

In [177]:
df5.drop(['c'])

     first  second  third  forth
ind
a        0       1      2      3
d        8       9     10     11
e       12      13     14     15

In [179]:
df5.drop(['second'], axis=1)

     first  third  forth
ind
a        0      2      3
c        4      6      7
d        8     10     11
e       12     14     15

In [186]:
df5[1:3]

     first  second  third  forth
ind
c        4       5      6      7
d        8       9     10     11

In [214]:
df5['a':'d']

     first  second  third  forth
ind
a        0       1      2      3
c        4       5      6      7
d        8       9     10     11

In [219]:
df5[:'a']

     first  second  third  forth
ind
a        0       1      2      3

In [222]:
df5['c':'d'] = 8
df5

     first  second  third  forth
ind
a        0       1      2      3
c        8       8      8      8
d        8       8      8      8
e       12      13     14     15

In [224]:
df5 < 7

     first  second  third  forth
ind
a     True    True   True   True
c    False   False  False  False
d    False   False  False  False
e    False   False  False  False

In [278]:
df5.ix[df5.index > 'b', 'first']     # number of columns to want

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

ind
c     4
d     8
e    12
Name: first, dtype: int64

In [269]:
reind = pd.Series(['a','b','c','d',1,2,3,4])
df6 = df5.reindex(reind)
df6

   first  second  third  forth
a    0.0     1.0    2.0    3.0
b    NaN     NaN    NaN    NaN
c    4.0     5.0    6.0    7.0
d    8.0     9.0   10.0   11.0
1    NaN     NaN    NaN    NaN
2    NaN     NaN    NaN    NaN
3    NaN     NaN    NaN    NaN
4    NaN     NaN    NaN    NaN

In [277]:
df6.ix[:'c', :3]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   first  second  third
a    0.0     1.0    2.0
b    NaN     NaN    NaN
c    4.0     5.0    6.0

In [276]:
df6.iloc[:df6.index.get_loc('c')+1, :3]

   first  second  third
a    0.0     1.0    2.0
b    NaN     NaN    NaN
c    4.0     5.0    6.0

In [287]:
df6.loc[:'c', ['first','second']]

   first  second
a    0.0     1.0
b    NaN     NaN
c    4.0     5.0